# ==========================================
# โจทย์ข้อที่ 2: คำนวณระดับเกรด (0 - 4)
# Input: คะแนนสอบ (จำนวนเต็ม 0 - 100)
# เงื่อนไข:
#   - คะแนน >= 80 ได้เกรด 4
#   - คะแนน >= 70 ได้เกรด 3
#   - คะแนน >= 60 ได้เกรด 2
#   - คะแนน >= 50 ได้เกรด 1
#   - คะแนนน้อยกว่า 50 ได้เกรด 0
# Output: ตัวเลขเกรด (0, 1, 2, 3 หรือ 4)
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
s = int(input("คะแนนสอบ 0 - 100 : "))
if s >= 80 :
    print("4")
elif s >= 70 :
    print("3")
elif s >= 60 :
    print("2")
elif s >= 50 :
    print("1")
else :
    print("0")
